Repository: Paradox07127/macos-wallpaperengine
Catalog: LiveWallpaper/Resources/Localizable.xcstrings
Source language: en
Languages: es, ja, zh_hans, zh_hant

source: Weather Location
es: Ubicación meteorológica
ja: 天気の場所
zh_hans: 天气位置
zh_hant: 天氣位置

source: Weather effects are disabled
es: Los efectos meteorológicos están desactivados
ja: 天気エフェクトは無効です
zh_hans: 天气效果已关闭
zh_hant: 天氣效果已關閉

source: Weather fetch error (paths and tokens scrubbed)
es: Error al obtener el tiempo (rutas y tokens redactados)
ja: 天気の取得エラー（パスとトークンを除去済み）
zh_hans: 天气获取错误（路径和令牌已脱敏）
zh_hant: 天氣取得錯誤（路徑與權杖已遮蔽）

source: Weather is off for this display
es: El tiempo está desactivado en esta pantalla
ja: このディスプレイでは天気オーバーレイがオフです
zh_hans: 此显示器未开启天气叠加层
zh_hant: 此顯示器未開啟天氣疊加層

source: Weather location source
es: Fuente de ubicación meteorológica
ja: 天気の位置情報ソース
zh_hans: 天气位置数据源
zh_hant: 天氣位置資料來源

source: Weather overlay
es: Superposición meteorológica
ja: 天気オーバーレイ
zh_hans: 天气叠加层
zh_hant: 天氣疊加層

source: Weather overlay active
es: Superposición meteorológica activa
ja: 天気オーバーレイが有効
zh_hans: 天气叠加层已启用
zh_hant: 天氣疊加層已啟用

source: Weather status: %@
es: Estado del tiempo: %@
ja: 天気の状態：%@
zh_hans: 天气状态：%@
zh_hant: 天氣狀態：%@

source: Weather-reactive effects
es: Efectos que reaccionan al tiempo
ja: 天気連動エフェクト
zh_hans: 天气响应效果
zh_hant: 天氣反應效果

source: Web API key
es: Clave de Web API
ja: Web API キー
zh_hans: Web API 密钥
zh_hant: Web API 金鑰

source: Web Options
es: Opciones web
ja: Web オプション
zh_hans: Web 选项
zh_hant: Web 選項

source: Web Rendering
es: Renderizado web
ja: Web レンダリング
zh_hans: Web 渲染
zh_hant: Web 渲染

source: Web address
es: Dirección web
ja: Web アドレス
zh_hans: 网址
zh_hant: 網址

source: Web file or folder
es: Archivo o carpeta web
ja: Web ファイルまたはフォルダ
zh_hans: Web 文件或文件夹
zh_hant: Web 檔案或資料夾

source: Web pages, local .html files, and folders.
es: Páginas web, archivos .html locales y carpetas.
ja: Web ページ、ローカル .html ファイル、フォルダ。
zh_hans: 网页、本地 .html 文件和文件夹。
zh_hant: 網頁、本機 .html 檔案和資料夾。

source: Web wallpaper active
es: Fondo de pantalla web activo
ja: Web 壁紙が有効
zh_hans: Web 壁纸使用中
zh_hant: Web 桌布使用中

source: Web wallpaper failed to load: %@
es: No se ha podido cargar el fondo de pantalla web: %@
ja: Web 壁紙の読み込みに失敗しました：%@
zh_hans: Web 壁纸加载失败：%@
zh_hant: Web 桌布載入失敗：%@

source: Web wallpaper type
es: Tipo de fondo de pantalla web
ja: Web 壁紙タイプ
zh_hans: Web 壁纸类型
zh_hant: Web 桌布類型

source: Welcome Tour
es: Recorrido de bienvenida
ja: 紹介ツアー
zh_hans: 欢迎导览
zh_hant: 歡迎導覽

source: Welcome to %@
es: Bienvenido a %@
ja: %@ へようこそ
zh_hans: 欢迎使用 %@
zh_hant: 歡迎使用 %@

source: When every step is done the Get Started capsule disappears; you can replay it from Settings.
es: Cuando termines todos los pasos, la cápsula «Primeros pasos» desaparece; puedes volver a verla desde Ajustes.
ja: すべて完了すると上部の「使ってみる」表示は消えます。設定からいつでも見直せます。
zh_hans: 完成后顶部“开始使用”胶囊会消失；随时可在设置里重新查看。
zh_hant: 完成後頂部「開始使用」膠囊會消失；隨時可在設定裡重新查看。

source: When frontmost
es: Cuando está al frente
ja: 最前面にあるとき
zh_hans: 位于最前时
zh_hant: 位於最前方時

source: When off, hides the app from the Dock and ⌘Tab. Open it from the menu bar.
es: Al desactivarlo, la app se oculta del Dock y de ⌘Tab. Se abre desde la barra de menús.
ja: オフにすると Dock と ⌘Tab に表示されません。メニューバーから開けます。
zh_hans: 关闭后不显示在 Dock 和 ⌘Tab 中，可从菜单栏打开。
zh_hant: 關閉後不顯示於 Dock 和 ⌘Tab，可從選單列開啟。

source: When on, the wallpaper's WKWebView starts fresh each session — cookies, localStorage, and cache are not persisted
es: Si está activado, el WKWebView del fondo de pantalla empieza de cero en cada sesión — las cookies, localStorage y la caché no se conservan
ja: オンの場合、壁紙の WKWebView はセッションごとに新規開始します。cookies、localStorage、キャッシュは保持されません
zh_hans: 开启后，壁纸的 WKWebView 每次会话都会重新开始——Cookie、localStorage 和缓存不会保留
zh_hant: 開啟時，桌布的 WKWebView 每次工作階段都會全新啟動；cookies、localStorage 和快取不會保留

source: Where requests go
es: Destino de las solicitudes
ja: リクエストの送信先
zh_hans: 请求发往何处
zh_hant: 請求發往何處

source: While running
es: Mientras se ejecuta
ja: 実行中
zh_hans: 运行时
zh_hant: 執行中

source: Wide Panel
es: Panel ancho
ja: ワイドパネル
zh_hans: 宽面板
zh_hant: 寬面板

source: Wide-gamut output for P3-capable displays.
es: Salida de gama amplia para pantallas compatibles con P3.
ja: P3 対応ディスプレイ向けの広色域出力。
zh_hans: 为 P3 显示器提供宽色域输出。
zh_hant: 為支援 P3 的顯示器提供廣色域輸出。

source: Widget Catalog
es: Catálogo de widgets
ja: ウィジェットカタログ
zh_hans: 小组件目录
zh_hant: 小工具目錄

source: Widget Options
es: Opciones de widgets
ja: ウィジェットのオプション
zh_hans: 小组件选项
zh_hant: 小工具選項

source: Widget Settings
es: Ajustes del widget
ja: ウィジェット設定
zh_hans: 小组件设置
zh_hant: 小工具設定

source: Widget opacity
es: Opacidad del widget
ja: ウィジェットの不透明度
zh_hans: 小组件不透明度
zh_hant: 小工具不透明度

source: Widget removed
es: Se eliminó el widget
ja: ウィジェットを削除しました
zh_hans: 已移除小组件
zh_hant: 已移除小工具

source: Widget size
es: Tamaño del widget
ja: ウィジェットのサイズ
zh_hans: 小组件大小
zh_hant: 小工具大小

source: Widget tint
es: Tinte del widget
ja: ウィジェットの色合い
zh_hans: 小组件配色
zh_hant: 小工具配色

source: Widgets are off for this display
es: Los widgets están desactivados en esta pantalla
ja: このディスプレイではウィジェットがオフです
zh_hans: 此显示器未开启小组件
zh_hant: 此顯示器未開啟小工具

source: Will apply to %@ when done
es: Se aplicará a %@ al terminar
ja: 完了後に %@ に適用予定
zh_hans: 下载完成后将应用到 %@
zh_hant: 下載完成後將套用到 %@

source: Win plugin
es: Complemento de Windows
ja: Windows プラグイン
zh_hans: Windows 插件
zh_hant: Windows 外掛程式

source: Windows Only
es: Solo Windows
ja: Windows 専用
zh_hans: 仅 Windows
zh_hant: 僅 Windows

source: Wired
es: Reservada
ja: 固定
zh_hans: 常驻
zh_hant: 常駐

source: Won't run
es: No se ejecutará
ja: 実行できません
zh_hans: 无法运行
zh_hant: 無法執行

source: Working
es: En curso
ja: 処理中
zh_hans: 进行中
zh_hant: 進行中

source: Works by %@
es: Obras de %@
ja: %@ の作品
zh_hans: %@ 的作品
zh_hant: %@ 的作品

source: Works by this creator
es: Obras de este creador
ja: この作成者の作品
zh_hans: 此创作者的作品
zh_hant: 此創作者的作品

source: Workshop ID
es: ID de Workshop
ja: ワークショップ ID
zh_hans: 创意工坊 ID
zh_hant: 工作坊 ID

# Workshop ID %@ · %@ type
source: Workshop ID %1$@ · %2$@ type
es: ID de Workshop %1$@ · tipo %2$@
ja: ワークショップ ID %1$@ · %2$@ タイプ
zh_hans: 创意工坊 ID %1$@ · %2$@ 类型
zh_hant: 工作坊 ID %1$@ · %2$@ 類型

source: Workshop ID %@. Find in Workshop.
es: ID de Workshop %@. Buscar en Workshop.
ja: ワークショップ ID %@。ワークショップで探します。
zh_hans: 创意工坊 ID %@。在创意工坊中查找。
zh_hant: 工作坊 ID %@。在工作坊中尋找。

source: Workshop URLs or item IDs
es: Enlaces de Workshop o ID de elementos
ja: ワークショップのURLまたはアイテムID
zh_hans: 创意工坊链接或项目 ID
zh_hant: 工作坊連結或項目 ID

source: Workshop content folder
es: Carpeta de contenido de Workshop
ja: ワークショップコンテンツフォルダ
zh_hans: 创意工坊内容文件夹
zh_hant: 工作坊內容資料夾

source: Workshop download owner was released.
es: Se ha liberado el propietario de la descarga de Workshop.
ja: ダウンロードの所有者が解放されました。
zh_hans: 下载管理对象已释放。
zh_hant: 下載管理物件已釋放。

source: Workshop item %@
es: Elemento de Workshop %@
ja: ワークショップ項目 %@
zh_hans: 创意工坊项目 %@
zh_hant: 工作坊項目 %@

source: Workshop item %llu
es: Elemento de Workshop %llu
ja: ワークショップ項目 %llu
zh_hans: 创意工坊项目 %llu
zh_hant: 工作坊項目 %llu

source: Workshop item not found. It may have been removed.
es: No se ha encontrado el elemento de Workshop. Puede que se haya eliminado.
ja: ワークショップ項目が見つかりません。削除された可能性があります。
zh_hans: 找不到创意工坊项目。它可能已被移除。
zh_hant: 找不到工作坊項目。它可能已被移除。

source: Workshop requests go straight to Valve over HTTPS. Nothing is sent to Loomscreen, and Loomscreen runs no server of its own.
es: Las solicitudes de Workshop van directas a Valve por HTTPS. No se envía nada a Loomscreen, y Loomscreen no ejecuta ningún servidor propio.
ja: ワークショップへのリクエストは HTTPS で Valve に直接送られます。Loomscreen には何も送信されず、Loomscreen 自身のサーバーは存在しません。
zh_hans: 创意工坊请求通过 HTTPS 直接发给 Valve。没有任何内容发往 Loomscreen，Loomscreen 也不运行自己的服务器。
zh_hant: 工作坊請求透過 HTTPS 直接發給 Valve。沒有任何內容發往 Loomscreen，Loomscreen 也不執行自己的伺服器。

source: Workshop requests go straight to Valve over HTTPS. Nothing is sent to Loomscreen.
es: Las solicitudes de Workshop van directas a Valve por HTTPS. No se envía nada a Loomscreen.
ja: ワークショップ へのリクエストは HTTPS で Valve に直接送信されます。Loomscreen には何も送信されません。
zh_hans: 创意工坊请求通过 HTTPS 直连 Valve，不会向 Loomscreen 发送任何内容。
zh_hant: 工作坊請求透過 HTTPS 直連 Valve，不會向 Loomscreen 傳送任何內容。

source: Workshop setup
es: Configuración de Workshop
ja: ワークショップのセットアップ
zh_hans: 创意工坊配置
zh_hant: 工作坊設定

source: Workshop tab
es: Pestaña Workshop
ja: ワークショップ タブ
zh_hans: 创意工坊标签页
zh_hant: 工作坊標籤頁

source: Workshop · Connect your Steam account
es: Workshop · Conecta tu cuenta de Steam
ja: ワークショップ · Steam アカウントを接続
zh_hans: 创意工坊 · 连接 Steam 账号
zh_hant: 工作坊 · 連接 Steam 帳號

source: Write rate
es: Velocidad de escritura
ja: 書き込み速度
zh_hans: 写入速率
zh_hant: 寫入速率

source: Yield the GPU while macOS is in Low Power Mode
es: Liberar la GPU mientras macOS está en Modo de bajo consumo
ja: macOS が低電力モードの間は GPU を解放します
zh_hans: macOS 处于低电量模式时释放 GPU
zh_hant: macOS 處於低耗電模式時釋放 GPU

source: Your Steam API key was disabled by Valve.
es: Valve ha desactivado tu clave de API de Steam.
ja: Steam API キーは Valve によって無効化されています。
zh_hans: 你的 Steam API 密钥已被 Valve 停用。
zh_hant: 你的 Steam API 金鑰已被 Valve 停用。

source: Your Steam API key was disabled by Valve. Regenerate one.
es: Valve ha desactivado tu clave de API de Steam. Genera una nueva.
ja: Steam API キーは Valve によって無効化されています。再発行してください。
zh_hans: 你的 Steam API 密钥已被 Valve 停用。请重新生成。
zh_hant: 你的 Steam API 金鑰已被 Valve 停用。請重新產生。

source: Your Steam account must own Wallpaper Engine.
es: Tu cuenta de Steam debe tener Wallpaper Engine.
ja: Steam アカウントが Wallpaper Engine を所有している必要があります。
zh_hans: 你的 Steam 账号需要拥有 Wallpaper Engine。
zh_hant: 你的 Steam 帳號需要擁有 Wallpaper Engine。

source: Your Steam password and Steam Guard codes go to SteamCMD only — sign in from Terminal, or reuse the session Steam already cached.
es: Tu contraseña de Steam y los códigos de Steam Guard van solo a SteamCMD — inicia sesión desde Terminal, o reutiliza la sesión que Steam ya tenga en caché.
ja: Steam のパスワードと Steam Guard コードは SteamCMD にのみ渡されます。ターミナルからサインインするか、Steam が既にキャッシュしたセッションを再利用してください。
zh_hans: 你的 Steam 密码和 Steam Guard 验证码只会交给 SteamCMD——在终端登录，或复用 Steam 已缓存的会话。
zh_hant: 你的 Steam 密碼和 Steam Guard 驗證碼只會交給 SteamCMD——在終端機登入，或重複使用 Steam 已快取的工作階段。

source: Your Steam password and Steam Guard codes go to SteamCMD only. Loomscreen never stores them, and never sends them anywhere else.
es: Tu contraseña de Steam y los códigos de Steam Guard van solo a SteamCMD. Loomscreen nunca los almacena ni los envía a ningún otro sitio.
ja: Steam のパスワードと Steam Guard コードは SteamCMD にのみ渡されます。Loomscreen が保存することも、ほかへ送信することもありません。
zh_hans: 你的 Steam 密码和 Steam 令牌验证码只会交给 SteamCMD。Loomscreen 既不保存，也不会发往别处。
zh_hant: 你的 Steam 密碼與 Steam 令牌驗證碼只會交給 SteamCMD。Loomscreen 既不儲存，也不會傳往別處。

source: Your Steam session expired. Sign in again in Terminal, then check again.
es: Tu sesión de Steam ha caducado. Vuelve a iniciar sesión en Terminal y comprueba de nuevo.
ja: Steam のセッションが期限切れです。ターミナルで再度サインインしてから確認してください。
zh_hans: 你的 Steam 会话已过期。请在终端重新登录后再检查。
zh_hant: 你的 Steam 工作階段已過期。請在終端機重新登入後再檢查。

source: Your password goes only to Valve's SteamCMD on this Mac and is never stored.
es: Tu contraseña va solo al SteamCMD de Valve en este Mac y nunca se almacena.
ja: パスワードはこの Mac 上の Valve 製 SteamCMD にのみ渡され、保存されることはありません。
zh_hans: 密码只会交给本机上 Valve 的 SteamCMD，绝不存储。
zh_hant: 密碼只會交給這台 Mac 上 Valve 的 SteamCMD，絕不儲存。

source: Your playlist is empty
es: La playlist está vacía
ja: プレイリストは空です
zh_hans: 播放列表为空
zh_hant: 播放列表為空

source: [Get a key](https://steamcommunity.com/dev/apikey) · [Steam Web API TOU](https://steamcommunity.com/dev/apiterms) · [About Limited Accounts](https://help.steampowered.com/en/faqs/view/71D3-35C2-AD96-AA3A)
es: [Obtener una clave](https://steamcommunity.com/dev/apikey) · [Condiciones de uso de la Steam Web API](https://steamcommunity.com/dev/apiterms) · [Acerca de las cuentas limitadas](https://help.steampowered.com/en/faqs/view/71D3-35C2-AD96-AA3A)
ja: [キーを取得](https://steamcommunity.com/dev/apikey) · [Steam Web API 利用規約](https://steamcommunity.com/dev/apiterms) · [制限付きアカウントについて](https://help.steampowered.com/en/faqs/view/71D3-35C2-AD96-AA3A)
zh_hans: [获取密钥](https://steamcommunity.com/dev/apikey) · [Steam Web API 使用条款](https://steamcommunity.com/dev/apiterms) · [关于受限账户](https://help.steampowered.com/en/faqs/view/71D3-35C2-AD96-AA3A)
zh_hant: [取得金鑰](https://steamcommunity.com/dev/apikey) · [Steam Web API 使用條款](https://steamcommunity.com/dev/apiterms) · [關於受限制帳戶](https://help.steampowered.com/en/faqs/view/71D3-35C2-AD96-AA3A)

source: active
es: activo
ja: 再生中
zh_hans: 播放中
zh_hant: 播放中

source: added %lld
es: añadidos %lld
ja: %lld 件を追加
zh_hans: 新增 %lld 个
zh_hant: 新增 %lld 個

source: ago
es: atrás
ja: 前
zh_hans: 前
zh_hant: 前

source: all sources nominal
es: todas las fuentes en estado nominal
ja: すべてのソースが正常
zh_hans: 所有来源正常
zh_hant: 所有來源正常

source: by %@
es: de %@
ja: 作成者: %@
zh_hans: 作者：%@
zh_hant: 作者：%@

source: colour = pressure
es: color = presión
ja: 色 = プレッシャー
zh_hans: 颜色 = 压力
zh_hant: 顏色 = 壓力

source: compute
es: cómputo
ja: コンピュート
zh_hans: 计算
zh_hant: 運算

source: connected
es: conectado
ja: 接続済み
zh_hans: 已连接
zh_hant: 已連線

source: constrained
es: restringido
ja: 制限あり
zh_hans: 受限
zh_hant: 受限

source: cool
es: frío
ja: 低温
zh_hans: 凉
zh_hant: 涼

source: critical
es: crítico
ja: 重大
zh_hans: 危急
zh_hant: 危急

source: done
es: listo
ja: 完了
zh_hans: 已完成
zh_hant: 已完成

source: ended
es: finalizado
ja: 終了
zh_hans: 已结束
zh_hant: 已結束

source: ended %@ ago
es: finalizó hace %@
ja: %@前に終了
zh_hans: 于 %@ 前结束
zh_hant: 於 %@ 前結束

# error.app.file_access_denied
source: Cannot access "%@"
es: No se puede acceder a "%@"
ja: 「%@」にアクセスできません
zh_hans: 无法访问“%@”
zh_hant: 無法存取「%@」

# error.app.file_access_denied.recovery
source: Try selecting the file again
es: Intenta seleccionar el archivo de nuevo
ja: ファイルを選び直してみてください
zh_hans: 尝试重新选择文件
zh_hant: 嘗試重新選擇檔案

# error.app.wpe_import_failed
source: Wallpaper Engine import failed: %@
es: Falló la importación de Wallpaper Engine: %@
ja: Wallpaper Engine のインポートに失敗しました: %@
zh_hans: Wallpaper Engine 导入失败：%@
zh_hant: Wallpaper Engine 匯入失敗：%@

# error.app.wpe_import_failed.recovery
source: Re-select the workshop folder and try again
es: Vuelve a seleccionar la carpeta del Workshop e inténtalo de nuevo
ja: ワークショップフォルダを選択し直して、もう一度試してください
zh_hans: 重新选择创意工坊文件夹并重试
zh_hant: 重新選取工作坊資料夾後再試一次

# error.app.wpe_package_invalid
source: Invalid Wallpaper Engine package: %@
es: Paquete de Wallpaper Engine no válido: %@
ja: 無効な Wallpaper Engine パッケージです: %@
zh_hans: 无效的 Wallpaper Engine 包：%@
zh_hant: 無效的 Wallpaper Engine 套件：%@

# error.app.wpe_package_invalid.recovery
source: Try re-downloading from Steam Workshop
es: Intenta volver a descargarlo desde Steam Workshop
ja: Steam ワークショップから再ダウンロードしてみてください
zh_hans: 尝试从 Steam 创意工坊重新下载
zh_hant: 嘗試從 Steam 工作坊重新下載

# error.render.executor.command_buffer_failed
source: WPE Metal command buffer failed.
es: Ha fallado el búfer de comandos de WPE Metal.
ja: WPE Metal コマンドバッファーが失敗しました。
zh_hans: WPE Metal 命令缓冲区失败。
zh_hant: WPE Metal 命令緩衝區失敗。

# error.render.executor.command_queue_unavailable
source: Metal command queue is unavailable.
es: La cola de comandos de Metal no está disponible.
ja: Metal コマンドキューを使用できません。
zh_hans: Metal 命令队列不可用。
zh_hant: Metal 命令佇列無法使用。

# error.render.executor.library_unavailable
source: WPE Metal built-in shader library is unavailable.
es: La biblioteca de sombreadores integrada de WPE Metal no está disponible.
ja: WPE Metal の組み込みシェーダーライブラリを使用できません。
zh_hans: WPE Metal 内置着色器库不可用。
zh_hant: WPE Metal 內建著色器程式庫無法使用。

# error.render.executor.missing_texture
source: WPE Metal executor is missing texture %@.
es: Al ejecutor de WPE Metal le falta la textura %@.
ja: WPE Metal エグゼキューターにテクスチャ %@ がありません。
zh_hans: WPE Metal 执行器缺少纹理 %@。
zh_hant: WPE Metal 執行器缺少紋理 %@。

# error.render.executor.no_renderable_passes
source: WPE Metal pipeline has no renderable passes.
es: El pipeline de WPE Metal no tiene pasos renderizables.
ja: WPE Metal パイプラインにレンダリング可能なパスがありません。
zh_hans: WPE Metal 管线没有可渲染的通道。
zh_hant: WPE Metal 管線沒有可渲染的通道。

# error.render.executor.pipeline_state_build_failed
source: Metal pipeline build failed for '%1$@': %2$@
es: Falló la creación del pipeline Metal para '%1$@': %2$@
ja: '%1$@' の Metal パイプライン構築に失敗しました: %2$@
zh_hans: 为“%1$@”构建 Metal 管线失败：%2$@
zh_hant: 為「%1$@」建構 Metal 管線失敗：%2$@

# error.render.executor.pipeline_unavailable
source: WPE Metal pipeline is unavailable for %@.
es: El pipeline de WPE Metal no está disponible para %@.
ja: %@ 用の WPE Metal パイプラインを使用できません。
zh_hans: %@ 的 WPE Metal 管线不可用。
zh_hant: WPE Metal 管線無法用於 %@。

# error.render.executor.render_target_dimensions_exceed_device_limit
source: WPE Metal render target '%1$@' is %2$lldx%3$lld, exceeding this device's %4$lldx%5$lld 2D texture limit.
es: El destino de renderizado de WPE Metal '%1$@' mide %2$lldx%3$lld y supera el límite de textura 2D de este dispositivo (%4$lldx%5$lld).
ja: WPE Metal のレンダーターゲット「%1$@」は %2$lldx%3$lld で、このデバイスの 2D テクスチャ制限 %4$lldx%5$lld を超えています。
zh_hans: WPE Metal 渲染目标“%1$@”为 %2$lldx%3$lld，超过此设备的 %4$lldx%5$lld 2D 纹理限制。
zh_hant: WPE Metal 渲染目標「%1$@」為 %2$lldx%3$lld，超過此裝置的 %4$lldx%5$lld 2D 紋理限制。

# error.render.executor.render_target_exceeds_limit_reason
source: render target '%@' is %lldx%lld, exceeding this device's %lldx%lld Metal texture limit
es: el destino de renderizado '%@' mide %lldx%lld y supera el límite de textura Metal de este dispositivo (%lldx%lld)
ja: レンダーターゲット「%@」は %lld×%lld で、このデバイスの Metal テクスチャ上限 %lld×%lld を超えています
zh_hans: 渲染目标“%@”尺寸为 %lld×%lld，超出该设备的 Metal 纹理上限 %lld×%lld
zh_hant: 渲染目標「%@」尺寸為 %lld×%lld，超出該裝置的 Metal 紋理上限 %lld×%lld

# error.render.executor.shader_translator_unavailable
source: WPE shader '%1$@' is unsupported by the Metal renderer: %2$@
es: El sombreador WPE '%1$@' no es compatible con el renderizador Metal: %2$@
ja: WPE シェーダー「%1$@」は Metal レンダラーでサポートされていません: %2$@
zh_hans: Metal 渲染器不支持 WPE 着色器“%1$@”：%2$@
zh_hant: Metal 渲染器不支援 WPE 著色器「%1$@」：%2$@

# error.render.executor.unsupported_shader
source: WPE Metal executor does not support shader %@.
es: El ejecutor de WPE Metal no admite el sombreador %@.
ja: WPE Metal エグゼキューターはシェーダー %@ をサポートしていません。
zh_hans: WPE Metal 执行器不支持着色器 %@。
zh_hant: WPE Metal 執行器不支援著色器 %@。

# error.render.executor.unsupported_shader_reason
source: shader '%@' unsupported by Metal renderer
es: sombreador '%@' no compatible con el renderizador Metal
ja: シェーダー '%@' は Metal レンダラーでは使用できません
zh_hans: 着色器 '%@' 不受 Metal 渲染器支持
zh_hant: 著色器 '%@' 不受 Metal 渲染器支援

# error.render.graph.file_missing
source: WPE graph asset missing: %@
es: Falta el recurso de grafo WPE: %@
ja: WPE グラフアセットが見つかりません: %@
zh_hans: WPE 渲染图资源缺失：%@
zh_hant: WPE 渲染圖資源遺失：%@

# error.render.graph.invalid_json
source: WPE graph asset is not valid JSON: %@
es: El recurso de grafo WPE no es JSON válido: %@
ja: WPE グラフアセットは有効な JSON ではありません: %@
zh_hans: WPE 渲染图资源不是有效的 JSON：%@
zh_hant: WPE 渲染圖資源不是有效的 JSON：%@

# error.render.graph.malformed_effect
source: WPE effect has no renderable passes: %@
es: El efecto WPE no tiene pasos renderizables: %@
ja: WPE エフェクトにレンダリング可能なパスがありません: %@
zh_hans: WPE 效果没有可渲染的通道：%@
zh_hant: WPE 特效沒有可渲染的通道：%@

# error.render.graph.malformed_material
source: WPE material has no renderable passes: %@
es: El material WPE no tiene pasos renderizables: %@
ja: WPE マテリアルにレンダリング可能なパスがありません: %@
zh_hans: WPE 材质没有可渲染的通道：%@
zh_hant: WPE 材質沒有可渲染的通道：%@

# error.render.graph.material_unresolved
source: Could not resolve WPE material for image reference: %@
es: No se pudo resolver el material WPE de la referencia de imagen: %@
ja: 画像参照の WPE マテリアルを解決できませんでした: %@
zh_hans: 无法解析图像引用的 WPE 材质：%@
zh_hant: 無法解析影像參照的 WPE 材質：%@

# error.render.pipeline.include_cycle
source: WPE shader include cycle detected at %@
es: Ciclo de include de sombreador WPE detectado en %@
ja: %@ で WPE シェーダーの include 循環が検出されました
zh_hans: 在 %@ 处检测到 WPE 着色器 include 循环
zh_hant: 在 %@ 偵測到 WPE 著色器 include 循環

# error.render.pipeline.include_missing
source: WPE shader include %1$@ requested by %2$@ is missing
es: Falta el include de sombreador WPE %1$@ solicitado por %2$@
ja: %2$@ が要求した WPE シェーダー include %1$@ が見つかりません
zh_hans: %2$@ 请求的 WPE 着色器包含文件 %1$@ 缺失
zh_hant: %2$@ 要求的 WPE 著色器 include 檔案 %1$@ 遺失

# error.render.pipeline.invalid_source_encoding
source: WPE shader source is not UTF-8: %@
es: El código fuente del sombreador WPE no está en UTF-8: %@
ja: WPE シェーダーソースは UTF-8 ではありません: %@
zh_hans: WPE 着色器源码不是 UTF-8：%@
zh_hant: WPE 著色器原始碼不是 UTF-8：%@

# error.render.pipeline.shader_missing
source: WPE shader %1$@ is missing %2$@ source at %3$@
es: Al sombreador WPE %1$@ le falta el código fuente %2$@ en %3$@
ja: WPE シェーダー %1$@ は %3$@ に %2$@ ソースがありません
zh_hans: WPE 着色器 %1$@ 在 %3$@ 缺少 %2$@ 源码
zh_hant: WPE 著色器 %1$@ 在 %3$@ 缺少 %2$@ 原始碼

# error.scene.document.invalid_utf8
source: scene.json is not valid UTF-8.
es: scene.json no es UTF-8 válido.
ja: scene.json は有効な UTF-8 ではありません。
zh_hans: scene.json 不是有效的 UTF-8。
zh_hant: scene.json 不是有效的 UTF-8。

# error.scene.document.malformed_field
source: scene.json field %@ is malformed.
es: El campo %@ de scene.json está mal formado.
ja: scene.json フィールド %@ の形式が正しくありません。
zh_hans: scene.json 字段 %@ 格式错误。
zh_hant: scene.json 欄位 %@ 格式錯誤。

# error.scene.document.missing_camera
source: scene.json is missing the required camera block.
es: scene.json no incluye el bloque camera obligatorio.
ja: scene.json に必須の camera ブロックがありません。
zh_hans: scene.json 缺少必需的 camera 块。
zh_hant: scene.json 缺少必要的 camera 區塊。

# error.scene.document.missing_general
source: scene.json is missing the required general block.
es: scene.json no incluye el bloque general obligatorio.
ja: scene.json に必須の general ブロックがありません。
zh_hans: scene.json 缺少必需的 general 块。
zh_hant: scene.json 缺少必要的 general 區塊。

# error.scene.document.root_not_object
source: scene.json must be a JSON object at the root.
es: scene.json debe ser un objeto JSON en la raíz.
ja: scene.json のルートは JSON オブジェクトである必要があります。
zh_hans: scene.json 根级别必须是 JSON 对象。
zh_hant: scene.json 根層級必須是 JSON 物件。

# error.scene.load_diagnostic.cross_package_reference
source: The layer '%1$@' requires files from an external package, which is not supported: %2$@.
es: La capa '%1$@' requiere archivos de un paquete externo, lo que no es compatible: %2$@.
ja: レイヤー「%1$@」は外部パッケージのファイルを必要としますが、未対応です:%2$@。
zh_hans: 图层“%1$@”需要外部包中的文件，暂不支持：%2$@。
zh_hant: 圖層「%1$@」需要外部套件中的檔案，暫不支援：%2$@。

# error.scene.load_diagnostic.file_missing
source: A file required by the '%@' layer is missing.
es: Falta un archivo que requiere la capa '%@'.
ja: レイヤー「%@」に必要なファイルが見つかりません。
zh_hans: 图层“%@”所需的文件缺失。
zh_hant: 圖層「%@」所需的檔案遺失。

# error.scene.load_diagnostic.file_missing.with_path
source: A file required by the '%1$@' layer is missing: %2$@.
es: Falta un archivo que requiere la capa '%1$@': %2$@.
ja: レイヤー「%1$@」に必要なファイルが見つかりません: %2$@。
zh_hans: 图层“%1$@”所需的文件缺失：%2$@。
zh_hant: 圖層「%1$@」所需的檔案遺失：%2$@。

# error.scene.load_diagnostic.legacy_unsupported_texture
source: The image format used by '%@' is no longer supported.
es: El formato de imagen usado por '%@' ya no es compatible.
ja: 「%@」で使用されている画像形式は現在サポートされていません。
zh_hans: “%@”使用的图像格式已不再支持。
zh_hant: 「%@」使用的影像格式已不再支援。

# error.scene.load_diagnostic.material_unresolved
source: A rendering feature needed by '%1$@' is not supported yet: %2$@.
es: Una función de renderizado que necesita '%1$@' aún no es compatible: %2$@.
ja: 「%1$@」に必要な描画機能はまだ対応していません:%2$@。
zh_hans: “%1$@”需要的渲染特性暂不支持：%2$@。
zh_hant: 「%1$@」需要的渲染特性暫不支援：%2$@。

# error.scene.load_diagnostic.other
source: The layer '%1$@' encountered an issue: %2$@.
es: La capa '%1$@' encontró un problema: %2$@.
ja: レイヤー「%1$@」で問題が発生しました: %2$@。
zh_hans: 图层“%1$@”遇到问题：%2$@。
zh_hant: 圖層「%1$@」發生問題：%2$@。

# error.scene.load_diagnostic.texture
source: The image for '%1$@' couldn't be loaded: %2$@.
es: No se pudo cargar la imagen de '%1$@': %2$@.
ja: 「%1$@」の画像を読み込めませんでした:%2$@。
zh_hans: 无法加载“%1$@”的图像：%2$@。
zh_hant: 無法載入「%1$@」的影像：%2$@。

# error.scene.rendering.cache_root_missing
source: Scene cache directory is missing.
es: Falta el directorio de caché de la escena.
ja: シーンキャッシュディレクトリが見つかりません。
zh_hans: 场景缓存目录缺失。
zh_hant: 場景快取目錄遺失。

# error.scene.rendering.metal_unsupported
source: Metal renderer cannot stage this scene: %@
es: El renderizador Metal no puede preparar esta escena: %@
ja: Metal レンダラーはこのシーンを描画できません: %@
zh_hans: Metal 渲染器无法呈现此场景：%@
zh_hant: Metal 渲染器無法呈現此場景：%@
